Page({
  data: {
    arrangement: "本科二批",
        arrangement_num: 1,
        arrangement_list: ["本科一批", "本科二批", "本科三批", "专科"],
        province: "广东",
        province_list: [
            "请选择您所在的省市",
            "山东",
            "江苏",
            "上海",
            "浙江",
            "安徽",
            "福建",
            "江西",
            "广东",
            "广西",
            "海南",
            "河南",
            "湖南",
            "湖北",
            "北京",
            "天津",
            "河北",
            "山西",
            "内蒙古",
            "宁夏",
            "青海",
            "陕西",
            "甘肃",
            "新疆",
            "四川",
            "贵州",
            "云南",
            "重庆",
            "西藏",
            "辽宁",
            "吉林",
            "黑龙江"
        ],
        type_list: ["文科", "理科"],
        type: "理科",
        type_num: 1,
        px: 0,
        school: "大连海事大学",
        line: [
            {
                year: "2015",
                grade: 519,
                y: 0
            },
            {
                year: "2016",
                grade: 402,
                y: 0
            },
            {
                year: "2017",
                grade: 360,
                y: 0
            }
        ]
  },
  
  onLoad() {},
});
